[  {
    "Date": "6/26/2025",
    "Reference": "Luke 20:9-19 NKJV",
    "Scripture": "[Luke 20:9-19 NKJV] 9 Then He began to tell the people this parable: \"A certain man planted a vineyard, leased it to vinedressers, and went into a far country for a long time. 10 \"Now at vintage-time he sent a servant to the vinedressers, that they might give him some of the fruit of the vineyard. But the vinedressers beat him and sent [him] away empty-handed. 11 \"Again he sent another servant; and they beat him also, treated [him] shamefully, and sent [him] away empty-handed. 12 \"And again he sent a third; and they wounded him also and cast [him] out. 13 \"Then the owner of the vineyard said, 'What shall I do? I will send my beloved son. Probably they will respect [him] when they see him.' 14 \"But when the vinedressers saw him, they reasoned among themselves, saying, 'This is the heir. Come, let us kill him, that the inheritance may be ours.' 15 \"So they cast him out of the vineyard and killed [him]. Therefore what will the owner of the vineyard do to them? 16 \"He will come and destroy those vinedressers and give the vineyard to others.\" And when they heard [it] they said, \"Certainly not!\" 17 Then He looked at them and said, \"What then is this that is written: 'The stone which the builders rejected Has become the chief cornerstone'? 18 \"Whoever falls on that stone will be broken; but on whomever it falls, it will grind him to powder.\" 19 And the chief priests and the scribes that very hour sought to lay hands on Him, but they feared the people--for they knew He had spoken this parable against them.",
    "Observation": "Jesus: tells a parable to explain the history of the chosen people, the Israelites.  The people: recognize the truth He's presenting, and are outraged at the outcome of the parable. Chief priests and scribes: more determined to \"lay hands on\" Jesus, but aren't sure how because of the crowd's support.",
    "Interpretation": "The interpretation of the parable is this: God is the owner of the vineyard.  The vineyard is the gospel message.  The fruit of the vineyard is changed hearts and lives - true worship of God through the people of Israel and beyond.  The vinedressers are the leaders of the synagogue.  The servants of the owner are the prophets.  The beloved son and heir is Jesus, the Messiah. Tying it together, God entrusted Israel to be priests to the nations - to love the Lord their God, and to be an example for the world to follow.  God sent prophets and priests, which the leaders of the temple beat and killed.  Still desiring for Israel to fulfill their destiny, God sent Jesus, His Son, to call them to account and be God's representative.  They would reject and kill him, outside of the city walls. [Isa28: 16-18NKJV] 16 Therefore thus says the Lord GOD: \"Behold, I lay in Zion a stone for a foundation, A tried stone, a precious cornerstone, a sure foundation; Whoever believes will not act hastily. 17 Also I will make justice the measuring line, And righteousness the plummet; The hail will sweep away the refuge of lies, And the waters will overflow the hiding place. 18 Your covenant with death will be annulled, And your agreement with Sheol will not stand; When the overflowing scourge passes through, Then you will be trampled down by it. [Psa 118:19-22 NKJV] 19 Open to me the gates of righteousness; I will go through them, [And] I will praise the LORD. 20 This is the gate of the LORD, Through which the righteous shall enter. 21 I will praise You, For You have answered me, And have become my salvation. 22 The stone [which] the builders rejected Has become the chief cornerstone. The people understood the message that was being delivered - apparently including that Jesus was predicting His own death at the hands of the leaders.  They also would have understood the reference to the chief cornerstone, and the consequences of not believing and direct opposition.  Everything was out in the open now.  The leaders knew that they would have a hard time taking Jesus into custody, now that the people had begun to put it together.",
  "Application": "The role of the nation of priests has now fallen to gentiles as well as Jews.  What am I doing with the gospel message?  Am I greedy with it, keeping it only for myself?  Am I preventing its spread? It is good to retreat and learn and try to grow myself, but is also necessary and expected that I share the gospel and the life and goodness that it produces.  How will I be intentional about this? 1. Have a good and positive disposition - be approachable. 2. Stand ready to give an account of my joy. 3. Look for what God is doing already to get the Word out and get onboard with it directly or through support. 4. Teach other people to do the same. a. Help prepare new Christians for growth and proper attitudes of the heart (disciple them). b. Teach them to be disciples and to make disciples. Teach them to start at step 1 above."
  },
  {
    "Date": "6/24/2025",
    "Reference": "Luke 18:31-34 NKJV",
    "Scripture": "[\"] 31 Then He took the twelve aside and said to them, \"Behold, we are going up to Jerusalem, and all things that are written by the prophets concerning the Son of Man will be accomplished. 32 \"For He will be delivered to the Gentiles and will be mocked and insulted and spit upon. 33 \"They will scourge [Him] and kill Him. And the third day He will rise again.\" 34 But they understood none of these things; this saying was hidden from them, and they did not know the things which were spoken.",
    "Observation": "Jesus is revealing His fulfilling of the prophecies - the horrible and Good News of the gospel message.",
    "Interpretation": "Up to this point, Jesus has preached and taught about the kingdom.  At this point, no one can truly understand the full message.  Here, He explains what will happen to Him as He becomes the perfect sacrifice for our sin.  Exactly what they thought of this, I don't know - but it was sure to have been filed away in their minds as one more thing to try and make sense of.  The purpose of this interaction was for the future - for me now and for them later.",
    "Application": "Salvation is sort of two-fold in one respect.  Jesus made the ultimate sacrifice for me, but that doesn't automatically put me into the kingdom.  I've got to have faith in all that He said prior to His death, burial, and resurrection.  Then the sacrifice becomes for me.  There is nothing that I can add to that.  Full stop?"
  },
  {
    "Date": "6/23/2025",
    "Reference": "Luke_18_18-23_NKJV",
    "Scripture": "[Luke 18:18-23 NKJV] 18 Now a certain ruler asked Him, saying, \"Good Teacher, what shall I do to inherit eternal life?\" 19 So Jesus said to him, \"Why do you call Me good? No one [is] good but One, [that is], God. 20 \"You know the commandments: 'Do not commit adultery,' 'Do not murder,' 'Do not steal,' 'Do not bear false witness,' 'Honor your father and your mother.' \" 21 And he said, \"All these things I have kept from my youth.\" 22 So when Jesus heard these things, He said to him, \"You still lack one thing. Sell all that you have and distribute to the poor, and you will have treasure in heaven; and come, follow Me.\" 23 But when he heard this, he became very sorrowful, for he was very rich. [Luke 18:24-30 NKJV] 24 And when Jesus saw that he became very sorrowful, He said, \"How hard it is for those who have riches to enter the kingdom of God! 25 \"For it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.\" 26 And those who heard it said, \"Who then can be saved?\" 27 But He said, \"The things which are impossible with men are possible with God.\" 28 Then Peter said, \"See, we have left all and followed You.\" 29 So He said to them, \"Assuredly, I say to you, there is no one who has left house or parents or brothers or wife or children, for the sake of the kingdom of God, 30 \"who shall not receive many times more in this present time, and in the age to come eternal life.\"",
    "Observation": "Jesus explains who can inherit eternal life - who can be saved.",
    "Interpretation": "In both instances above, what was required was faith that God would provide what was needed, and feet to walk the path that He lays out.  Leave behind anything that might be more important, and follow Jesus.",
    "Application": "In today's time, we can't literally follow Jesus, because He's not here bodily.  But we can try to see what God is doing, and get on-board with it.  This could mean physically staying right where I am, or it could mean picking up and going somewhere else.  Who knows?"
  }


]